**Q1 Empty Neighborhoods**
Weâ€™re given two tables, a users table with demographic information and the neighborhood they live in and a neighborhoods table.

Write a query that returns all neighborhoods that have 0 users.

In [3]:
import pandas as pd

users = pd.read_csv('data/users.csv')
neighborhoods = pd.read_csv('data/neighborhoods.csv')

In [4]:
user_neig = users[['id', 'neighborhood_id']].merge(neighborhoods, left_on='neighborhood_id', right_on='id', how='right')

In [5]:
user_neig[user_neig['neighborhood_id'].isnull()][['name']]

        name
9     jtrain
12  jackraus
13     fiver

**Q2** Given a table of bank transactions with columns id, transaction_value, and created_at representing the date and time for each transaction, write a query to get the last transaction for each day.

The output should include the id of the transaction, datetime of the transaction, and the transaction amount. Order the transactions by datetime.

Example:

Input:

bank_transactions table

| Column      | Type |
| ----------- | ----------- |
| id      | INTEGER       |
| created_at   | DATETIME      |
|transaction_value|FLOAT|


Output:

| Column      | Type |
| ----------- | ----------- |
| created_at   | DATETIME      |
|transaction_value|FLOAT|
| id      | INTEGER       |

In [58]:
bank_transactions = pd.read_csv('data/bank_transactions.csv')

In [59]:
bank_transactions.head()

      created_at  id  transaction_value
0  1/1/2020 2:21   1                 45
1  1/1/2020 1:21   2                -65
2  1/1/2020 1:14   3                 25
3  1/2/2020 0:11   4                 45
4  1/2/2020 0:12   5                -30

In [60]:
bank_transactions.dtypes

created_at           object
id                    int64
transaction_value     int64
dtype: object

In [61]:
pd.to_datetime(bank_transactions['created_at'])

0   2020-01-01 02:21:00
1   2020-01-01 01:21:00
2   2020-01-01 01:14:00
3   2020-01-02 00:11:00
4   2020-01-02 00:12:00
5   2020-01-02 02:32:00
6   2020-01-03 01:30:00
7   2020-01-04 01:41:00
8   2020-01-04 01:48:00
Name: created_at, dtype: datetime64[ns]

In [62]:
bank_transactions['created_at'] = pd.to_datetime(bank_transactions['created_at'])

In [63]:
bank_transactions.astype({'id': int, 'transaction_value': float})

           created_at  id  transaction_value
0 2020-01-01 02:21:00   1               45.0
1 2020-01-01 01:21:00   2              -65.0
2 2020-01-01 01:14:00   3               25.0
3 2020-01-02 00:11:00   4               45.0
4 2020-01-02 00:12:00   5              -30.0
5 2020-01-02 02:32:00   6               45.0
6 2020-01-03 01:30:00   7              -35.0
7 2020-01-04 01:41:00   8               75.0
8 2020-01-04 01:48:00   9               40.0

In [64]:
bank_transactions.dtypes

created_at           datetime64[ns]
id                            int64
transaction_value             int64
dtype: object

In [65]:
bank_transactions['month'] = bank_transactions['created_at'].dt.month

In [66]:
bank_transactions['year'] = bank_transactions['created_at'].dt.year

In [67]:
bank_transactions['year'] = bank_transactions['created_at'].dt.day

In [68]:
bank_transactions

           created_at  id  transaction_value  month  year
0 2020-01-01 02:21:00   1                 45      1     1
1 2020-01-01 01:21:00   2                -65      1     1
2 2020-01-01 01:14:00   3                 25      1     1
3 2020-01-02 00:11:00   4                 45      1     2
4 2020-01-02 00:12:00   5                -30      1     2
5 2020-01-02 02:32:00   6                 45      1     2
6 2020-01-03 01:30:00   7                -35      1     3
7 2020-01-04 01:41:00   8                 75      1     4
8 2020-01-04 01:48:00   9                 40      1     4

In [71]:
bank_transactions.groupby(['year', 'month'])[['id', 'created_at', 'transaction_value']].apply(
    lambda x: x.sort_values(by='created_at')).tail(1)

              id          created_at  transaction_value
year month
4    1     8   9 2020-01-04 01:48:00                 40

**Q3** Given three tables, representing customer transactions and customer attributes:

Write a query to get the average order value by gender.

Note: Weâ€™re looking at the average order value by users that have ever placed an order. Additionally, please round your answer to two decimal places.

Example:

Input:

transactions table

| Column      | Type |
| ----------- | ----------- |
| id      | INTEGER       |
|user_id|INTEGER|
| created_at   | DATETIME   |
|product_id|INTEGER|
|quantity|INTEGER|


users2 table

| Column      | Type |
| ----------- | ----------- |
| id      | INTEGER       |
|name|VARCHAR|
|sex|VARCHAR|

products table

| Column      | Type |
| ----------- | ----------- |
| id      | INTEGER       |
|name|VARCHAR|
|price|FLOAT|

Output:

| Column      | Type |
| ----------- | ----------- |
|sex|VARCHAR|
|aov|FLOAT|

In [19]:
transactions = pd.read_csv('data/transactions.csv')
users2 = pd.read_csv('data/users2.csv')
products = pd.read_csv('data/products.csv')

In [20]:
transactions['created_at'] = pd.to_datetime(transactions['created_at'])

In [21]:
transactions.dtypes

created_at    datetime64[ns]
id                     int64
product_id             int64
quantity               int64
user_id                int64
dtype: object

In [22]:
users2.dtypes
products.dtypes

id         int64
name      object
price    float64
dtype: object

In [23]:
products = products.astype({'id': int, 'name': str, 'price': float})

In [24]:
products.dtypes

id         int64
name      object
price    float64
dtype: object

In [25]:
tran_prod = transactions.merge(products, left_on='product_id', right_on='id', how='right')

In [26]:
tran_prod.head()

,created_at,id_x,product_id,quantity,user_id,id_y,name,price
0,2019-01-25,106,1,5,54,1,few local receive,37.32
1,2019-01-23,104,2,1,53,2,land debate here,24.98
2,2019-01-19,101,3,3,50,3,dinner suffer truth,175.47
3,2019-01-23,105,4,3,53,4,sometimes tonight billion,172.00
4,2019-01-19,100,5,2,50,5,person require analysis,80.00

In [27]:
tran_prod['qp'] = tran_prod['quantity'] * tran_prod['price']

In [28]:
tran_prod_user = tran_prod.merge(users2, left_on='user_id', right_on='id', how='right')

In [29]:
tran_prod_user.groupby(['sex'])[['quantity', 'price']].mean()

     quantity    price
sex
F    2.600000   26.054
M    1.833333  107.575

In [30]:
aov = tran_prod_user.groupby(['sex'])[['qp']].mean()

**Q4** Assign the median price to missing price values

In [31]:
import numpy as np

cheeses = {"Name": ["Bohemian Goat", "Central Coast Bleu",\
                    "Cowgirl Mozzarella", "Cypress Grove Cheddar",\
                    "Oakdale Colby"], "Price" : [15.00, None, 30.00, None, 45.00]}

In [32]:
df = pd.DataFrame(cheeses)

In [33]:
df['Price'] = df['Price'].fillna(df['Price'].median())

In [34]:
df['Price'].head()

0    15.0
1    30.0
2    30.0
3    30.0
4    45.0
Name: Price, dtype: float64

**Q5: Acceptance Rate**: Weâ€™re given two tables. friend_requests holds all the friend requests made and friend_accepts is all of the acceptances.

Write a query to find the overall acceptance rate of friend requests. Note: Round results to 4 decimal places.

Example:

Input:

friend_requests table

| Column      | Type |
| ----------- | ----------- |
| requester_id|INTEGER|
|requested_id|INTEGER|
|created_at|DATETIME|


friend_accepts table

| Column      | Type |
| ----------- | ----------- |
| acceptor_id|INTEGER|
|requester_id|INTEGER|
|created_at|DATETIME|


Output:

| Column      | Type |
| ----------- | ----------- |
| acceptance_rate   | FLOAT     |

In [35]:
friend_accepts = {"acceptor_id":[75, 54, 43],  "requester_id": [2,1,5], 
                   "created_at":["2020-09-24 00:00:00",\
                                 "2020-09-25 00:00:00","2020-09-27 00:00:00"]}

friend_requests={"requester_id":[1,2,3,4,5], 
                "requested_id":[54,75,35,24,43],
                "created_at":["2020-09-23 00:00:00",\
                              "2020-09-24 00:00:00","2020-09-24 00:00:00",
                              "2020-09-25 00:00:00","2020-09-26 00:00:00"]}

In [36]:
friends = pd.DataFrame(friend_requests)

In [37]:
NA = len(friends) - len(pd.DataFrame(friend_accepts))

**Q6: Employee Salaries**

Letâ€™s say we have a table representing a company payroll schema.

Due to an ETL error, the employees table instead of updating the salaries every year when doing compensation adjustments, did an insert instead. The head of HR still needs the current salary of each employee.

Bonus: Write a query to get the current salary for each employee.

Note: Assume no duplicate combination of first and last names. (I.E. No two John Smiths)

Example:

Input:

employees table

|Column|Type|
|------|-------|
|id|VARCHAR|
|first_name|VARCHAR|
|last_name|VARCHAR|
|salary|INTEGER|
|department_id|INTEGER|

Output:

|Column|Types|
|------|------|
|first_name|VARCHAR|
|last_name|VARCHAR|
|salary|INTEGER|

In [40]:
employees = pd.read_csv("data/employees.csv")

In [41]:
current_salaries = employees.groupby(['first_name', 'last_name'])['salary'].max().reset_index()

In [42]:
current_salaries

    first_name    last_name     salary
0     "Alfred"       "Wong"   110239.0
1      "Alina"        "Chu"   130000.0
2   "Anderson"      "Ifill"   100200.0
3     "Aretha"    "Jenkins"   333333.0
4     "Arvind"        "Tuk"   140000.0
5     "August"      "Rains"   300000.0
6        "Ben"       "Wang"    99999.0
7       "Bill"      "Smith"   175000.0
8        "Bob"      "Smith"  1550000.0
9       "Chad"  "McDaniels"    64000.0
10   "Cynthia"       "Sams"   720192.0
11    "Dillon"  "Jefferson"    30000.0
12   "Dorothy"       "Gall"  5000000.0
13        "Ed"    "Winters"   292314.0
14     "Jason"     "Joseph"   100000.0
15      "Jeff"        "Chu"    95000.0
16   "Lakesha"    "Jackson"   421232.0
17  "Maninder"      "Singh"   111000.0
18     "Marco"      "Ruben"    89100.0
19       "Ted"   "Thompson"    90000.0

**Q7: Good Grades and Favorite Colors**
Youâ€™re given a dataframe of students named students_df:

students_df table

|name|age|favorite_color|grade|
|----|---|----------|-------|
|Tim Voss|19|red91|
|Nicole Johnson|20|yellow|95|
|Elsa Williams|21|green|82|
|John James|20|blue|75|
|Catherine Jones|23|green|93|

Write a function named grades_colors to select only the rows where the studentâ€™s favorite color is green or red and their grade is above 90.

In [44]:
students_df=pd.read_csv("data/students.csv")
students_df

              name  age favorite_color  grade
0         Tim Voss   19            red     91
1   Nicole Johnson   20         yellow     95
2    Elsa Williams   21          green     82
3       John James   20           blue     75
4  Catherine Jones   23          green     93

In [46]:
good_grades_colors = students_df[
    (students_df['favorite_color'].isin(['red', 'green'])) & 
    (students_df['grade'] > 90)
]

In [47]:
good_grades_colors

              name  age favorite_color  grade
0         Tim Voss   19            red     91
4  Catherine Jones   23          green     93

**Q8: Rain on Rainy Days**
Youâ€™re given a dataframe df_rain containing rainfall data. The dataframe has two columns: day of the week and rainfall in inches.

Write a function median_rainfall to find the median amount of rainfall for the days on which it rained.

Note: You may assume it rained on at least one of the days.

In [69]:
import pandas as pd
df_rain = pd.DataFrame({"Day":["Monday", "Tuesday", "Wednesday",\
                               "Thursday", "Friday"],"Inches":[6,0,2,3,5]})

4.0

**Q9: First Name Only**
Youâ€™re given a dataframe containing a list of user IDs and their full names (e.g. â€˜James Emersonâ€™).

Transform this dataframe into a dataframe that contains the user ids and only the first name of each user.

In [70]:
import pandas as pd

users_df=pd.DataFrame({"user_id": [1034, 9430, 7281, 5264, 8995],
                       "name": ["James Emerson","Fiona Woodward",\
                                "Alvin Gross","Deborah Handler","Leah Xue"]})

**Q10 Second Highest Salary**
Write a  query to select the 2nd highest salary in the engineering department. If more than one person shares the highest salary, the query should select the next highest salary.

Example:

Input:

employees table

|Column|Type|
|------|-----|
|id|INTEGER|
|first_name|VARCHAR|
|last_name|VARCHAR|
|salary|INTEGER|
|department_id|INTEGER|

departments table

|Column|Type|
|-----|-----|
|id|INTEGER|
|name|VARCHAR|

Output:

|Column|Type|
|------|----|
|salary|INTEGER|

In [77]:
import pandas as pd
departments = pd.DataFrame({"id":[1,2,3,4],\
                            "name":["engineering", "marketing", "sales", "hr"]})
employees = pd.read_csv("data/employees2.csv")